In [2]:
import seaborn as sns

In [3]:
df=sns.load_dataset("titanic")

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [6]:
df.shape

(891, 15)

In [7]:
df.drop(columns=["deck"],inplace=True)

In [8]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [9]:
df["age"].fillna(df["age"].median,inplace=True)

/tmp/ipykernel_3836/482020857.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '<bound method Series.median of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64>' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df["age"].fillna(df["age"].median,inplace=True)

In [10]:
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64

In [11]:
df.dropna(subset=['embarked','embark_town'],inplace=True)

In [12]:
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [13]:
import numpy as np
import pandas as pd

In [14]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Length: 889, dtype: bool

In [15]:
df.duplicated().sum()

np.int64(111)

In [16]:
df.drop_duplicates(inplace=True)  #we can also use df.drop_duplicates(keep="first",inplace=True)

In [17]:
df.duplicated().sum()

np.int64(0)

In [18]:
df.shape

(778, 14)

In [19]:
df.describe()

         survived      pclass       sibsp       parch        fare
count  778.000000  778.000000  778.000000  778.000000  778.000000
mean     0.411311    2.249357    0.526992    0.419023   34.712987
std      0.492388    0.853206    0.988956    0.839346   52.280326
min      0.000000    1.000000    0.000000    0.000000    0.000000
25%      0.000000    1.000000    0.000000    0.000000    8.050000
50%      0.000000    3.000000    0.000000    0.000000   15.900000
75%      1.000000    3.000000    1.000000    1.000000   33.890600
max      1.000000    3.000000    8.000000    6.000000  512.329200

In [20]:
numerical_column=df.select_dtypes(include='number')

In [21]:
categorical_column=df.select_dtypes(exclude='number')

In [22]:
numerical_column.head()

   survived  pclass  sibsp  parch     fare
0         0       3      1      0   7.2500
1         1       1      1      0  71.2833
2         1       3      0      0   7.9250
3         1       1      1      0  53.1000
4         0       3      0      0   8.0500

In [23]:
categorical_column.head()

      sex   age embarked  class    who  adult_male  embark_town alive  alone
0    male  22.0        S  Third    man        True  Southampton    no  False
1  female  38.0        C  First  woman       False    Cherbourg   yes  False
2  female  26.0        S  Third  woman       False  Southampton   yes   True
3  female  35.0        S  First  woman       False  Southampton   yes  False
4    male  35.0        S  Third    man        True  Southampton    no   True

In [24]:
from sklearn.preprocessing import LabelEncoder

In [25]:
le=LabelEncoder()

In [26]:
df['sex']=le.fit_transform(df['sex'])
df['adult_male']=le.fit_transform(df['adult_male'])
df['alone']=le.fit_transform(df['alone'])
df['alive']=le.fit_transform(df['alive'])

In [27]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,S,Third,man,1,Southampton,0,0
1,1,1,0,38.0,1,0,71.2833,C,First,woman,0,Cherbourg,1,0
2,1,3,0,26.0,0,0,7.9250,S,Third,woman,0,Southampton,1,1
3,1,1,0,35.0,1,0,53.1000,S,First,woman,0,Southampton,1,0
4,0,3,1,35.0,0,0,8.0500,S,Third,man,1,Southampton,0,1

In [28]:
df=pd.get_dummies(df,columns=['embarked','class','who','embark_town'],drop_first=True)

In [29]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,adult_male,alive,alone,embarked_Q,embarked_S,class_Second,class_Third,who_man,who_woman,embark_town_Queenstown,embark_town_Southampton
0,0,3,1,22.0,1,0,7.2500,1,0,0,False,True,False,True,True,False,False,True
1,1,1,0,38.0,1,0,71.2833,0,1,0,False,False,False,False,False,True,False,False
2,1,3,0,26.0,0,0,7.9250,0,1,1,False,True,False,True,False,True,False,True
3,1,1,0,35.0,1,0,53.1000,0,1,0,False,True,False,False,False,True,False,True
4,0,3,1,35.0,0,0,8.0500,1,0,1,False,True,False,True,True,False,False,True

In [30]:
bool_cols=df.select_dtypes('bool').columns

In [31]:
bool_cols

Index(['embarked_Q', 'embarked_S', 'class_Second', 'class_Third', 'who_man',
       'who_woman', 'embark_town_Queenstown', 'embark_town_Southampton'],
      dtype='object')

In [32]:
df[bool_cols]=df[bool_cols].astype(int)

In [33]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,adult_male,alive,alone,embarked_Q,embarked_S,class_Second,class_Third,who_man,who_woman,embark_town_Queenstown,embark_town_Southampton
0,0,3,1,22.0,1,0,7.2500,1,0,0,0,1,0,1,1,0,0,1
1,1,1,0,38.0,1,0,71.2833,0,1,0,0,0,0,0,0,1,0,0
2,1,3,0,26.0,0,0,7.9250,0,1,1,0,1,0,1,0,1,0,1
3,1,1,0,35.0,1,0,53.1000,0,1,0,0,1,0,0,0,1,0,1
4,0,3,1,35.0,0,0,8.0500,1,0,1,0,1,0,1,1,0,0,1

In [34]:
from sklearn.preprocessing import StandardScaler

In [35]:
ss=StandardScaler()

In [36]:
#scal_column=df[['age','fare']]

In [37]:
df['age']=pd.to_numeric(df['age'],errors='coerce')

In [38]:
df['fare']=pd.to_numeric(df['age'],errors='coerce')

In [39]:
df[['age','fare']].dtypes

age     float64
fare    float64
dtype: object

In [40]:
df[['age','fare']]=ss.fit_transform(df[['age','fare']])

In [41]:
df.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,adult_male,alive,alone,embarked_Q,embarked_S,class_Second,class_Third,who_man,who_woman,embark_town_Queenstown,embark_town_Southampton
623,0,3,1,-0.596151,0,0,-0.596151,1,0,1,0,1,0,1,1,0,0,1
527,0,1,1,NaN,0,0,NaN,1,0,1,0,1,0,0,1,0,0,1
793,0,1,1,NaN,0,0,NaN,1,0,1,0,0,0,0,1,0,0,0
626,0,2,1,1.855786,0,0,1.855786,1,0,1,1,0,1,0,1,0,1,0
779,1,1,0,0.902255,0,1,0.902255,0,1,0,0,1,0,0,0,1,0,1

In [42]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'adult_male', 'alive', 'alone', 'embarked_Q', 'embarked_S',
       'class_Second', 'class_Third', 'who_man', 'who_woman',
       'embark_town_Queenstown', 'embark_town_Southampton'],
      dtype='object')

In [43]:
X=df.drop('survived',axis=1)
y=df['survived']

In [46]:
df.to_csv("titanic_cleaned.csv")